spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3CreditCardGateway/when_setup_purchase/creates_a_new_purchase_via_the_Buckaroo_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_culture=EN&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_payment_method=mastercard&brq_startrecurrent=false&brq_websitekey=<WEBSITEKEY>&brq_return=http%3A%2F%2Flocalhost%2Freturnurl&brq_service_mastercard_action=Pay&brq_signature=5e28522235e5a9de3fab568093fcd64a944344e5
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 09:00:11 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '567'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dca8e3fe2fa23e0dd46c1f381aea89e2c1597827611; expires=Fri, 18-Sep-20
        09:00:11 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a78b92410000bd91b08bf200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c52aeca0cd2bd91-AMS
    body:
      encoding: ASCII-8BIT
      string: BRQ_ACTIONREQUIRED=redirect&BRQ_AMOUNT=1.23&BRQ_APIRESULT=ActionRequired&BRQ_CURRENCY=EUR&BRQ_DESCRIPTION=Description&BRQ_INVOICENUMBER=2013-0001&BRQ_MUTATIONTYPE=NotSet&BRQ_REDIRECTURL=https%3a%2f%2fcheckout.buckaroo.nl%2fhtml%2fredirect.ashx%3fr%3d21DF69234D3246209C80AD0E43075CDB&BRQ_STATUSCODE=790&BRQ_STATUSMESSAGE=Pending+input&BRQ_TEST=false&BRQ_TIMESTAMP=2020-08-19+11%3a00%3a11&BRQ_TRANSACTIONS=B10FB963515B4A32A2414BFEEA582428&BRQ_WEBSITEKEY=<WEBSITEKEY>&BRQ_SIGNATURE=d15e20d2b436c280c2fb48cb24ea1048549d6636
  recorded_at: Wed, 19 Aug 2020 09:00:11 GMT
recorded_with: VCR 6.0.0
