spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3CreditCardGateway/when_setup_recurring/creates_a_new_recurring_via_the_Buckaroo_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_originaltransaction=AAAABBBB&brq_payment_method=mastercard&brq_websitekey=<WEBSITEKEY>&brq_service_mastercard_action=PayRecurrent&brq_signature=bdfb15c0880d975f8a65454393d6a956ffae70c9
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 09:00:10 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '513'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d8dfa15e91d1f71c5c6e0dfa688db93311597827610; expires=Fri, 18-Sep-20
        09:00:10 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a78b908c0000d8edfc066200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c52aec748cad8ed-AMS
    body:
      encoding: ASCII-8BIT
      string: BRQ_AMOUNT=1.23&BRQ_APIRESULT=Success&BRQ_CURRENCY=EUR&BRQ_INVOICENUMBER=2013-0001&BRQ_PAYMENT=89E1B0F2793C22C0B62EE0F8E971AD21&BRQ_PAYMENT_METHOD=mastercard&BRQ_SERVICE_MASTERCARD_CARDNUMBERENDING=1111&BRQ_STATUSCODE=190&BRQ_STATUSCODE_DETAIL=S001&BRQ_STATUSMESSAGE=Payment+successfully+processed&BRQ_TEST=false&BRQ_TIMESTAMP=2013-06-14+14%3a59%3a36&BRQ_TRANSACTIONS=AABKKKE5810949444B92F51A4CAH8HDD&BRQ_SIGNATURE=69874b68009b5a1f161c3267c1d7c298806f5c9c
  recorded_at: Wed, 19 Aug 2020 09:00:10 GMT
recorded_with: VCR 6.0.0
