spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3CreditCardGateway/when_setup_purchase/still_works_with_empty_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_culture=EN&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_payment_method=mastercard&brq_startrecurrent=false&brq_websitekey=<WEBSITEKEY>&brq_return=http%3A%2F%2Flocalhost%2Freturnurl&brq_service_mastercard_action=Pay&brq_signature=5e28522235e5a9de3fab568093fcd64a944344e5
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 09:00:11 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '566'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d1248e8bafc4b664f8873446b1736a5a51597827611; expires=Fri, 18-Sep-20
        09:00:11 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a78b92fe00000ba508141200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c52aecb3fae0ba5-AMS
    body:
      encoding: ASCII-8BIT
      string: ""
  recorded_at: Wed, 19 Aug 2020 09:00:11 GMT
recorded_with: VCR 6.0.0
