spec/fixtures/vcr_cassettes/ActiveMerchant_Billing_BuckarooBPE3CreditCardGateway/when_setup_recurring/still_works_with_crappy_response.yml

---
http_interactions:
- request:
    method: post
    uri: https://checkout.buckaroo.nl/nvp/?op=TransactionRequest
    body:
      encoding: ASCII-8BIT
      string: brq_amount=1.23&brq_currency=EUR&brq_description=Description&brq_invoicenumber=2013-0001&brq_originaltransaction=AAAABBBB&brq_payment_method=mastercard&brq_websitekey=<WEBSITEKEY>&brq_service_mastercard_action=PayRecurrent&brq_signature=bdfb15c0880d975f8a65454393d6a956ffae70c9
    headers:
      Content-Type:
      - application/x-www-form-urlencoded; charset=utf-8
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 19 Aug 2020 09:00:10 GMT
      Content-Type:
      - text/plain; charset=utf-8
      Content-Length:
      - '514'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d405e1577ab29e6264d5c294af0e0ebe31597827610; expires=Fri, 18-Sep-20
        09:00:10 GMT; path=/; domain=.buckaroo.nl; HttpOnly; SameSite=Lax; Secure
      Cache-Control:
      - private
      Vary:
      - Accept-Encoding
      X-Robots-Tag:
      - noindex, nofollow
      Cf-Cache-Status:
      - DYNAMIC
      Cf-Request-Id:
      - 04a78b8f7700009d60efbc4200000001
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Strict-Transport-Security:
      - max-age=15552000; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 5c52aec58c359d60-AMS
    body:
      encoding: ASCII-8BIT
      string: this is a very nasty response
  recorded_at: Wed, 19 Aug 2020 09:00:10 GMT
recorded_with: VCR 6.0.0
